# Ex. 33 Beyond 3 - Verbal SAT Scores

You analyzed math scores. If you perform the same analysis on verbal SAT
scores, will you similarly see that wealthier students generally do better than
poorer students? Do any income brackets do worse than the next-poorer
bracket?

In [56]:
import pandas as pd
import numpy as np

In [57]:
math_cols = ['Year', 'State.Code', 'Total.Math', 'Family Income.Less than 20k.Math',
'Family Income.Between 20-40k.Math', 'Family Income.Between 40-60k.Math',
'Family Income.Between 60-80k.Math', 'Family Income.Between 80-100k.Math',
'Family Income.More than 100k.Math']
math_cols

['Year',
 'State.Code',
 'Total.Math',
 'Family Income.Less than 20k.Math',
 'Family Income.Between 20-40k.Math',
 'Family Income.Between 40-60k.Math',
 'Family Income.Between 60-80k.Math',
 'Family Income.Between 80-100k.Math',
 'Family Income.More than 100k.Math']

In [58]:
verbal_cols = []
for item in math_cols:
    verbal_item = item.replace('Math', 'Verbal')
    verbal_cols.append(verbal_item)

verbal_cols

['Year',
 'State.Code',
 'Total.Verbal',
 'Family Income.Less than 20k.Verbal',
 'Family Income.Between 20-40k.Verbal',
 'Family Income.Between 40-60k.Verbal',
 'Family Income.Between 60-80k.Verbal',
 'Family Income.Between 80-100k.Verbal',
 'Family Income.More than 100k.Verbal']

In [59]:
math_name_dict = {'Family Income.Less than 20k.Math': 'income<20k',
            'Family Income.Between 20-40k.Math': '20k<income<40k', 
             'Family Income.Between 40-60k.Math': '40k<income<60k',
            'Family Income.Between 60-80k.Math':'60k<income<80k', 
             'Family Income.Between 80-100k.Math':'80k<income<100k',
            'Family Income.More than 100k.Math':'income>100k'}
math_name_dict

{'Family Income.Less than 20k.Math': 'income<20k',
 'Family Income.Between 20-40k.Math': '20k<income<40k',
 'Family Income.Between 40-60k.Math': '40k<income<60k',
 'Family Income.Between 60-80k.Math': '60k<income<80k',
 'Family Income.Between 80-100k.Math': '80k<income<100k',
 'Family Income.More than 100k.Math': 'income>100k'}

In [60]:
verbal_name_dict = {}
for key, value in math_name_dict.items():
    verbal_key = key.replace('Math', 'Verbal')
    verbal_name_dict[verbal_key] = value

verbal_name_dict

{'Family Income.Less than 20k.Verbal': 'income<20k',
 'Family Income.Between 20-40k.Verbal': '20k<income<40k',
 'Family Income.Between 40-60k.Verbal': '40k<income<60k',
 'Family Income.Between 60-80k.Verbal': '60k<income<80k',
 'Family Income.Between 80-100k.Verbal': '80k<income<100k',
 'Family Income.More than 100k.Verbal': 'income>100k'}

In [61]:
df_math = pd.read_csv('../data/sat-scores.csv', header=0, usecols=math_cols)

In [76]:
df_verbal = pd.read_csv('../data/sat-scores.csv', header=0, usecols=verbal_cols)
df_verbal.head()

,Year,State.Code,Total.Verbal,Family Income.Between 20-40k.Verbal,Family Income.Between 40-60k.Verbal,Family Income.Between 60-80k.Verbal,Family Income.Between 80-100k.Verbal,Family Income.Less than 20k.Verbal,Family Income.More than 100k.Verbal
0,2005,AL,567,527,551,564,577,474,590
1,2005,AK,523,500,522,519,534,467,544
2,2005,AZ,526,495,518,523,533,474,546
3,2005,AR,563,526,555,570,580,486,589
4,2005,CA,504,458,494,511,525,421,551

In [63]:
# df2 = pd.read_csv('../data/sat-scores.csv', header=0)
# print(df2.shape)
# df2.columns

In [110]:
df_math = df_math.rename(columns=math_name_dict)
ordered_col_names_math = list(df_math.columns[:3]) + list(math_name_dict.values())
ordered_col_names_math

['Year',
 'State.Code',
 'Total.Math',
 'income<20k',
 '20k<income<40k',
 '40k<income<60k',
 '60k<income<80k',
 '80k<income<100k',
 'income>100k']

In [112]:
df_math_reordered = df_math.loc[:, ordered_col_names_math]
df_math_reordered.head()

,Year,State.Code,Total.Math,income<20k,20k<income<40k,40k<income<60k,60k<income<80k,80k<income<100k,income>100k
0,2005,AL,559,462,513,539,550,566,588
1,2005,AK,519,464,492,517,513,528,541
2,2005,AZ,530,485,498,520,524,534,554
3,2005,AR,552,489,513,543,553,570,572
4,2005,CA,522,451,477,506,521,535,566

In [111]:
df_verbal = df_verbal.rename(columns=verbal_name_dict)
ordered_col_names_verbal = list(df_verbal.columns[:3]) + list(verbal_name_dict.values())
ordered_col_names_verbal

['Year',
 'State.Code',
 'Total.Verbal',
 'income<20k',
 '20k<income<40k',
 '40k<income<60k',
 '60k<income<80k',
 '80k<income<100k',
 'income>100k']

In [86]:
df_verbal_reordered = df_verbal.loc[:, ordered_col_names_verbal]
df_verbal_reordered.head()

,income<20k,20k<income<40k,40k<income<60k,60k<income<80k,80k<income<100k,income>100k
0,474,527,551,564,577,590
1,467,500,522,519,534,544
2,474,495,518,523,533,546
3,486,526,555,570,580,589
4,421,458,494,511,525,551

In [68]:
df_verbal.head()

,Year,State.Code,Total.Verbal,20k<income<40k,40k<income<60k,60k<income<80k,80k<income<100k,income<20k,income>100k
0,2005,AL,567,527,551,564,577,474,590
1,2005,AK,523,500,522,519,534,467,544
2,2005,AZ,526,495,518,523,533,474,546
3,2005,AR,563,526,555,570,580,486,589
4,2005,CA,504,458,494,511,525,421,551

In [66]:
df_math.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 577 entries, 0 to 576
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Year             577 non-null    int64
 1   State.Code       577 non-null    object
 2   Total.Math       577 non-null    int64
 3   20k<income<40k   577 non-null    int64
 4   40k<income<60k   577 non-null    int64
 5   60k<income<80k   577 non-null    int64
 6   80k<income<100k  577 non-null    int64
 7   income<20k       577 non-null    int64
 8   income>100k      577 non-null    int64
dtypes: int64(8), object(1)
memory usage: 40.7+ KB

In [67]:
df_verbal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 577 entries, 0 to 576
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Year             577 non-null    int64
 1   State.Code       577 non-null    object
 2   Total.Verbal     577 non-null    int64
 3   20k<income<40k   577 non-null    int64
 4   40k<income<60k   577 non-null    int64
 5   60k<income<80k   577 non-null    int64
 6   80k<income<100k  577 non-null    int64
 7   income<20k       577 non-null    int64
 8   income>100k      577 non-null    int64
dtypes: int64(8), object(1)
memory usage: 40.7+ KB

In [70]:
df_math.head()

,Year,State.Code,Total.Math,20k<income<40k,40k<income<60k,60k<income<80k,80k<income<100k,income<20k,income>100k
0,2005,AL,559,513,539,550,566,462,588
1,2005,AK,519,492,517,513,528,464,541
2,2005,AZ,530,498,520,524,534,485,554
3,2005,AR,552,513,543,553,570,489,572
4,2005,CA,522,477,506,521,535,451,566

In [71]:
df_verbal.head()

,Year,State.Code,Total.Verbal,20k<income<40k,40k<income<60k,60k<income<80k,80k<income<100k,income<20k,income>100k
0,2005,AL,567,527,551,564,577,474,590
1,2005,AK,523,500,522,519,534,467,544
2,2005,AZ,526,495,518,523,533,474,546
3,2005,AR,563,526,555,570,580,486,589
4,2005,CA,504,458,494,511,525,421,551

Find the average SAT math score for each income level, grouped and then
sorted by year.

In [44]:
df_math.select_dtypes(include=np.number)

,Year,Total.Math,20k<income<40k,40k<income<60k,60k<income<80k,80k<income<100k,income<20k,income>100k
0,2005,559,513,539,550,566,462,588
1,2005,519,492,517,513,528,464,541
2,2005,530,498,520,524,534,485,554
3,2005,552,513,543,553,570,489,572
4,2005,522,477,506,521,535,451,566
...,...,...,...,...,...,...,...,...
572,2015,517,469,488,496,514,441,549
573,2015,511,483,503,521,534,449,560
574,2015,500,468,483,487,503,448,522
575,2015,606,551,596,590,605,573,615
576,2015,587,533,550,561,598,0,573

In [73]:
df_verbal.select_dtypes(include=np.number)

,Year,Total.Verbal,20k<income<40k,40k<income<60k,60k<income<80k,80k<income<100k,income<20k,income>100k
0,2005,567,527,551,564,577,474,590
1,2005,523,500,522,519,534,467,544
2,2005,526,495,518,523,533,474,546
3,2005,563,526,555,570,580,486,589
4,2005,504,458,494,511,525,421,551
...,...,...,...,...,...,...,...,...
572,2015,518,472,494,505,518,446,550
573,2015,502,473,499,517,530,437,552
574,2015,509,481,492,501,511,455,532
575,2015,591,544,579,580,595,532,603
576,2015,588,560,572,604,587,0,591

In [81]:
df_verbal_reordered = df_verbal.loc[:, ordered_col_names_verbal]a

KeyError: "None of [Index(['income<20k', '20k<income<40k', '40k<income<60k', '60k<income<80k',\n       '80k<income<100k', 'income>100k'],\n      dtype='object')] are in the [columns]"

In [74]:
df_math.select_dtypes(include=np.number).mean()

Year               2010.019064
Total.Math          535.682842
20k<income<40k      500.239168
40k<income<60k      522.844021
60k<income<80k      533.611785
80k<income<100k     547.055459
income<20k          461.734835
income>100k         565.830156
dtype: float64

In [75]:
df_verbal.select_dtypes(include=np.number).mean()

Year               2010.019064
Total.Verbal        531.334489
20k<income<40k      501.327556
40k<income<60k      523.083189
60k<income<80k      533.845754
80k<income<100k     544.582322
income<20k          458.433276
income>100k         560.492201
dtype: float64

In [46]:
df_math.groupby('Year').mean(numeric_only=True).sort_index()

,Total.Math,20k<income<40k,40k<income<60k,60k<income<80k,80k<income<100k,income<20k,income>100k
Year,,,,,,,
2005,535.653846,488.653846,522.673077,536.076923,548.942308,427.596154,572.173077
2006,537.480769,502.923077,523.769231,534.903846,550.461538,461.019231,572.519231
2007,535.339623,494.849057,519.490566,533.188679,545.698113,457.924528,565.169811
2008,535.981132,523.622642,547.471698,549.188679,557.641509,478.641509,564.566038
2009,540.803922,527.823529,550.980392,553.941176,565.333333,482.058824,585.784314
2010,540.843137,499.274510,522.000000,534.235294,547.627451,477.039216,569.274510
2011,533.226415,494.886792,513.415094,528.660377,541.849057,460.452830,563.245283
2012,533.603774,492.056604,512.452830,525.773585,538.301887,458.773585,557.320755
2013,532.622642,490.132075,511.377358,520.320755,537.396226,469.358491,556.339623
2014,534.283019,497.641509,514.943396,527.169811,543.132075,459.415094,555.433962
2015,533.094340,491.603774,513.754717,527.132075,542.037736,447.490566,563.433962

In [47]:
(
    df_math
    .groupby('Year')
    [['income<20k',
      '20k<income<40k',
      '40k<income<60k',
      '60k<income<80k',
      '80k<income<100k',
      'income>100k']]
    .mean()
    .T
    .pct_change()
)

Year,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
income<20k,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20k<income<40k,0.142793,0.090894,0.080635,0.093977,0.094936,0.046611,0.074783,0.072548,0.044260,0.083207,0.098579
40k<income<60k,0.069618,0.041450,0.049796,0.045546,0.043872,0.045517,0.037439,0.041451,0.043346,0.034768,0.045059
60k<income<80k,0.025645,0.021259,0.026368,0.003136,0.005374,0.023439,0.029694,0.025994,0.017489,0.023743,0.026038
80k<income<100k,0.023999,0.029085,0.023462,0.015391,0.020566,0.025068,0.024947,0.023828,0.032817,0.030279,0.028277
income>100k,0.042319,0.040071,0.035682,0.012418,0.036175,0.039529,0.039487,0.035331,0.035250,0.022650,0.039474

In [48]:
(
    df_math
    .groupby('Year')
        [['income<20k',
        '20k<income<40k',
        '40k<income<60k',
        '60k<income<80k',
        '80k<income<100k',
        'income>100k']]
    .mean()
    .T
    .pct_change()
    .T
    .mean()
)

income<20k              NaN
20k<income<40k     0.083929
40k<income<60k     0.045260
60k<income<80k     0.020744
80k<income<100k    0.025247
income>100k        0.034399
dtype: float64

In [49]:
df_math.mean(axis='columns', numeric_only=True)

0      722.750
1      697.375
2      706.250
3      724.625
4      697.875
        ...
572    686.125
573    697.000
574    678.250
575    768.875
576    677.125
Length: 577, dtype: float64

In [50]:
change = (
df_math
.groupby('Year')
[['income<20k',
'20k<income<40k',
'40k<income<60k',
'60k<income<80k',
'80k<income<100k',
'income>100k']]
.mean()
.T
.pct_change()
)
# change <= 0
change[change <= 0].dropna()

Empty DataFrame
Columns: [2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015]
Index: []

## Beyond 1
Calculate descriptive statistics for all the changes in income brackets. Where do
you see the largest difference between income brackets?

In [51]:
change = df_math.groupby('Year')[['income<20k',
                      '20k<income<40k',
                      '40k<income<60k',
                      '60k<income<80k',
                      '80k<income<100k',
                      'income>100k']].mean().T.pct_change() 

# largest is for the wealthiest students, whose average scores are 
# far higher than any other income bracket.
change
# change.T.describe()

Year,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
income<20k,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20k<income<40k,0.142793,0.090894,0.080635,0.093977,0.094936,0.046611,0.074783,0.072548,0.044260,0.083207,0.098579
40k<income<60k,0.069618,0.041450,0.049796,0.045546,0.043872,0.045517,0.037439,0.041451,0.043346,0.034768,0.045059
60k<income<80k,0.025645,0.021259,0.026368,0.003136,0.005374,0.023439,0.029694,0.025994,0.017489,0.023743,0.026038
80k<income<100k,0.023999,0.029085,0.023462,0.015391,0.020566,0.025068,0.024947,0.023828,0.032817,0.030279,0.028277
income>100k,0.042319,0.040071,0.035682,0.012418,0.036175,0.039529,0.039487,0.035331,0.035250,0.022650,0.039474

## Beyond 2

Which five states have the greatest gap in SAT math scores between the richest
and poorest students?

In [52]:
df_math.columns

Index(['Year', 'State.Code', 'Total.Math', '20k<income<40k', '40k<income<60k',
       '60k<income<80k', '80k<income<100k', 'income<20k', 'income>100k'],
      dtype='object')

In [53]:
df_math['score_diff'] = df_math['income>100k'] - df_math['income<20k']

In [54]:
(
df_math[['State.Code', 'income<20k', 'income>100k', 'score_diff']]
    .groupby('State.Code').mean()
    .sort_values(by='score_diff', ascending=False)
    .head()
)

            income<20k  income>100k  score_diff
State.Code
ND          237.454545   579.363636  341.909091
WY          313.818182   560.272727  246.454545
DC          375.000000   583.818182  208.818182
SD          417.818182   574.818182  157.000000
MS          444.636364   584.636364  140.000000

In [55]:
(
df_math[['State.Code', 'score_diff']]
    .groupby('State.Code').mean()
    .sort_values(by='score_diff', ascending=False)
    .head()
)

            score_diff
State.Code
ND          341.909091
WY          246.454545
DC          208.818182
SD          157.000000
MS          140.000000